fix: update posts
